xcweaver/socialnetwork/evaluation/local/2024-06-20_18:23:33_workload.txt
Running 30s test @ http://localhost:9000/wrk2-api/post/compose
  2 threads and 2 connections
  Thread calibration: mean lat.: 65.143ms, rate sampling interval: 312ms
  Thread calibration: mean lat.: 41.251ms, rate sampling interval: 140ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    65.16ms   44.77ms 217.34ms   78.35%
    Req/Sec    24.31      9.67    43.00     69.42%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   52.74ms
 75.000%   86.21ms
 90.000%  126.97ms
 99.000%  217.34ms
 99.900%  284.16ms
 99.990%  300.80ms
 99.999%  300.80ms
100.000%  300.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      14.271     0.000000            1         1.00
      22.559     0.100000           99         1.11
      27.759     0.200000          196         1.25
      35.135     0.300000          294         1.43
      43.071     0.400000          392         1.67
      52.735     0.500000          490         2.00
      58.111     0.550000          539         2.22
      63.391     0.600000          588         2.50
      69.823     0.650000          637         2.86
      76.031     0.700000          687         3.33
      86.463     0.750000          735         4.00
      91.839     0.775000          759         4.44
      97.791     0.800000          784         5.00
     104.063     0.825000          808         5.71
     110.463     0.850000          833         6.67
     118.079     0.875000          857         8.00
     122.047     0.887500          869         8.89
     127.295     0.900000          882        10.00
     131.839     0.912500          894        11.43
     137.087     0.925000          906        13.33
     142.207     0.937500          918        16.00
     146.175     0.943750          924        17.78
     148.991     0.950000          931        20.00
     158.207     0.956250          937        22.86
     163.967     0.962500          943        26.67
     169.215     0.968750          949        32.00
     171.519     0.971875          952        35.56
     175.359     0.975000          955        40.00
     182.527     0.978125          958        45.71
     189.695     0.981250          961        53.33
     194.687     0.984375          964        64.00
     210.047     0.985938          966        71.11
     216.447     0.987500          967        80.00
     217.343     0.989062          969        91.43
     219.263     0.990625          970       106.67
     230.143     0.992188          972       128.00
     235.647     0.992969          973       142.22
     235.647     0.993750          973       160.00
     258.943     0.994531          974       182.86
     269.823     0.995313          975       213.33
     275.455     0.996094          976       256.00
     275.455     0.996484          976       284.44
     275.455     0.996875          976       320.00
     278.015     0.997266          977       365.71
     278.015     0.997656          977       426.67
     284.159     0.998047          978       512.00
     284.159     0.998242          978       568.89
     284.159     0.998437          978       640.00
     284.159     0.998633          978       731.43
     284.159     0.998828          978       853.33
     300.799     0.999023          979      1024.00
     300.799     1.000000          979          inf
#[Mean    =       65.156, StdDeviation   =       44.768]
#[Max     =      300.544, Total count    =          979]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1504 requests in 30.00s, 689.93KB read
Requests/sec:     50.13
Transfer/sec:     23.00KB
